# Label Utils Get Label For Unit Method

Source: https://www.revitapidocs.com/2026/96491567-d6a1-23ed-2d82-673d5b1dfc5b.htm

---

| Label Utils Get Label For Unit Method |
| --- |

Gets the user\-visible name for a unit.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetLabelForUnit(
	ForgeTypeId unitTypeId
)
```

```
Public Shared Function GetLabelForUnit (
	unitTypeId As ForgeTypeId
) As String
```

```
public:
static String^ GetLabelForUnit(
	ForgeTypeId^ unitTypeId
)
```

```
static member GetLabelForUnit :
        unitTypeId : ForgeTypeId -> string
```

#### Parameters

unitTypeId ForgeTypeId
:   Identifier of the unit to get the user\-visible name.

#### Return Value

String
Returns the user\-visible name for a unit. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Cannot find DisplayUnitTypeInfo for the given unit identifier. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace